# Aggregathing DataFrames 
 En este notebook, se calcularan estadisticas de resumen en columnas de DataFrames y dominaras las estadisticas agrupadas (pivot table )

## Estadistocas de Resumen 

Media y Mediana 

Las estadisticas resumidas son exactamente lo que parecen: resumen muchos números en una sola estadistica. Por ejemplo, la media, la mediana, el minimo y la desviación tipica (Desviación estandar) son estadisticas de resumen. Calcular estadisticas de resumen te permite hacerte una mejor idea de tus datos aunque sean muchos
**Instrucciones** 

- Explorar el nuevo DataFrame imprimiendo las primeras filas del Data/frame walmar_sales
- Imprimir información sobre las columnas 
- Imprimir la media de la columna weekly_sales
- Imprimir la mediana de la columna weekly_sales

In [67]:
import pandas as pd

In [68]:
sales = pd.read_csv("./dataSets/walmart_sales.csv")
sales.head()

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.50,2.625,211.350143,8.106

In [69]:
sales.shape

(6435, 8)

In [70]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6435 entries, 0 to 6434
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Store         6435 non-null   int64
 1   Date          6435 non-null   object
 2   Weekly_Sales  6435 non-null   float64
 3   Holiday_Flag  6435 non-null   int64
 4   Temperature   6435 non-null   float64
 5   Fuel_Price    6435 non-null   float64
 6   CPI           6435 non-null   float64
 7   Unemployment  6435 non-null   float64
dtypes: float64(5), int64(2), object(1)
memory usage: 402.3+ KB

In [71]:
sales.describe()

,Store,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
count,6435.000000,6.435000e+03,6435.000000,6435.000000,6435.000000,6435.000000,6435.000000
mean,23.000000,1.046965e+06,0.069930,60.663782,3.358607,171.578394,7.999151
std,12.988182,5.643666e+05,0.255049,18.444933,0.459020,39.356712,1.875885
min,1.000000,2.099862e+05,0.000000,-2.060000,2.472000,126.064000,3.879000
25%,12.000000,5.533501e+05,0.000000,47.460000,2.933000,131.735000,6.891000
50%,23.000000,9.607460e+05,0.000000,62.670000,3.445000,182.616521,7.874000
75%,34.000000,1.420159e+06,0.000000,74.940000,3.735000,212.743293,8.622000
max,45.000000,3.818686e+06,1.000000,100.140000,4.468000,227.232807,14.313000

In [72]:
# Media de la columna weekly_sales
round(sales['Weekly_Sales'].mean(),2)

np.float64(1046964.88)

In [73]:
# Mediana de la columna weekly_sales
sales['Weekly_Sales'].median()

np.float64(960746.04)

## Resumir Fechas 
Las estadisticas sumarias tambien pueden calcularse sobre columas de fecha que tengan valores con el tipo de dato datetime64. Algunas estadisticas de resumen como la media no tienen mucho sentido en la fecha, pero otras son extremadamente jutiles como, por ejemplo el minimo y el maximo que te permiten ver el intervalo que abarca tus datos 

**Instrucciones**

- Imprimir el maximo de la columna date
- Imprimir el minimo de la columna date

In [74]:
sales["Date2"] = sales["Date"].astype("datetime64[ns]")

In [75]:
# - Imprimir el maximo de la columna date
sales['Date'].max()

'31-12-2010'

In [76]:
# - Imprimir el minimo de la columna date
sales['Date'].min()

'01-04-2011'

# Función Agg

Aunque pandas numpy tiene muchas funciones aveces puedes nececitar una duncion diferente para resumir los datos 

El metodo .agg() Permite aplicar tus propias funciones personalizadas a un DataFrame, asi como aplicar funciones a mas de una columna de un DataFRame a la vez, haciendo que tus agregaciones sean muy eficientes. 
`df['column'].agg(funcion)`

En la función personalizada para este ejercicio "IQR" es la abreviatura del rango intercuantilico, que es el percentil 75 menos del percentil 25.
Es una alternativa a la desviación tipica  (estandar) que resulta util si tus datos contienen valores atípicos.

**Instrucciones**
1. Utiliza la funcion personalizada iqr definida por ti junto con el metodo.
agg() para imprimir IQR de la columna temperature_c de las sales
2. Actualiza la seleccion de columnas para utilizar la función personalizada iqr con .agg() para imprimir los iqr de las columnas temperature, fuel_price, unemployment, en orden.
3. Actualiza las llamadad la funcion agg, para obtener el rango iqr y la media

In [77]:
import numpy as np
def iqr (columna):
    return columna.quantile(0.75) - columna.quantile(0.25)

In [78]:
# Imprimir IQR de la columna temperature 
print("IQR de la columna temperature:", iqr(sales["Temperature"]))

IQR de la columna temperature: 27.479999999999997

In [79]:
# imprimir iqr de la columna temperature 
print(f'El IQR de Temperature {sales['Temperature']}')

El IQR de Temperature 0       42.31
1       38.51
2       39.93
3       46.63
4       46.50
        ...
6430    64.88
6431    64.89
6432    54.47
6433    56.47
6434    58.85
Name: Temperature, Length: 6435, dtype: float64

In [80]:
# Actualizar la impresion del iqr de temperature , fuel_price, unemployment, en orden.

print(sales[['Temperature', 'Fuel_Price', 'Unemployment']].agg(iqr))

Temperature     27.480
Fuel_Price       0.802
Unemployment     1.731
dtype: float64

In [81]:
#. Actualiza las llamadad la funcion agg, para obtener el rango iqr y la media 
print(sales[['Temperature', 'Fuel_Price', 'Unemployment']].agg([iqr, 'median']))

        Temperature  Fuel_Price  Unemployment
iqr           27.48       0.802         1.731
median        62.67       3.445         7.874

In [82]:
print(sales[['Temperature', 'Fuel_Price', 'Unemployment']].agg([iqr, 'median','mean', 'max', 'min']))

        Temperature  Fuel_Price  Unemployment
iqr       27.480000    0.802000      1.731000
median    62.670000    3.445000      7.874000
mean      60.663782    3.358607      7.999151
max      100.140000    4.468000     14.313000
min       -2.060000    2.472000      3.879000

In [83]:
def convertirACentigrados(Farenheit):
    return (Farenheit - 32) / 1.8

In [84]:
temp_min = sales['Temperature'].min()
temp_max = sales['Temperature'].max()

In [85]:
print(f'La tempertura {temp_min} en Centigrados es {convertirACentigrados(temp_min)}')
print(f'La tempertura {temp_max} en Centigrados es {convertirACentigrados(temp_max)}')

La tempertura -2.06 en Centigrados es -18.922222222222224
La tempertura 100.14 en Centigrados es 37.855555555555554

In [86]:
sales['Temperature_Celsious'] = convertirACentigrados(sales['Temperature']).agg(convertirACentigrados)

C:\Users\linnr\AppData\Local\Temp\ipykernel_4324\301622382.py:1: FutureWarning: using <function convertirACentigrados at 0x0000023A84DE05E0> in Series.agg cannot aggregate and has been deprecated. Use Series.transform to keep behavior unchanged.
  sales['Temperature_Celsious'] = convertirACentigrados(sales['Temperature']).agg(convertirACentigrados)

In [87]:
sales[['Temperature', 'Temperature_Celsious']]

      Temperature  Temperature_Celsious
0           42.31            -14.595679
1           38.51            -15.768519
2           39.93            -15.330247
3           46.63            -13.262346
4           46.50            -13.302469
...           ...                   ...
6430        64.88             -7.629630
6431        64.89             -7.626543
6432        54.47            -10.842593
6433        56.47            -10.225309
6434        58.85             -9.490741

[6435 rows x 2 columns]

In [88]:
# Funcion persolalizada que calcula el IQR
def iqr(column):
    return column.quantile(0.75) - column.quantile(0.25)

# Imprimir el IQR de la columna Temperature 
print(sales['Temperature'].quantile(0.75))
print(sales['Temperature'].quantile(0.25))
print(sales['Temperature'].agg(iqr))
print(sales['Temperature'].agg(['mean', 'std', 'max', 'min']))

74.94
47.46
27.479999999999997
mean     60.663782
std      18.444933
max     100.140000
min      -2.060000
Name: Temperature, dtype: float64

## Estadísticas acumuladas

Las estadísticas acumulativas también pueden ser útiles para hacer un seguimiento de las estadísticas resumidas a lo largo del tiempo. En este ejercicio, calcularás la suma acumulada y el máximo acumulado de las ventas semanales de un departamento, lo que te permitirá identificar cuáles han sido las ventas totales hasta el momento, así como cuáles han sido las ventas semanales más elevadas hasta el momento.

**Instrucciones**

- Ordena las filas de sales_1_1 por la columna date en orden ascendente.
- Obtén la suma acumulada de weekly_sales y añádelo como una nueva columna de sales_1_1 llamada cum_weekly_sales.
- Obtén el máximo acumulado de weekly_sales, y añádelo como una columna llamada cum_max_sales.
- Imprime las columnas date, weekly_sales, cum_weekly_sales, y cum_max_sales.

In [89]:
sales_1_1 = sales[sales['Store'] == 1]

# Ordenar sales_1_1 por fecha 
sales_1_1 = sales_1_1.sort_values('Date')

# Obtener la suma acumulatuiva de el weekly_sales y agregarla como una nueva columna llamada cum_weekly_sales
sales_1_1['cum_weekly_sales'] = sales_1_1['Weekly_Sales'].cumsum()

In [90]:
sales_1_1[['Weekly_Sales', 'cum_weekly_sales']]

     Weekly_Sales  cum_weekly_sales
60     1495064.75      1.495065e+06
121    1624477.58      3.119542e+06
73     1488538.09      4.608080e+06
34     1453329.50      6.061410e+06
108    1688420.76      7.749831e+06
..            ...               ...
25     1371986.60      2.165614e+08
86     1394561.83      2.179559e+08
99     1497462.72      2.194534e+08
134    1582083.40      2.210355e+08
47     1367320.01      2.224028e+08

[143 rows x 2 columns]

In [91]:
sales_1_1.head()

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment,Date2,Temperature_Celsious,cum_weekly_sales
60,1,01-04-2011,1495064.75,0,59.17,3.524,214.837166,7.682,2011-01-04,-9.391975,1495064.75
121,1,01-06-2012,1624477.58,0,77.95,3.501,221.747214,7.143,2012-01-06,-3.595679,3119542.33
73,1,01-07-2011,1488538.09,0,85.55,3.524,215.184137,7.962,2011-01-07,-1.250000,4608080.42
34,1,01-10-2010,1453329.50,0,71.89,2.603,211.671989,7.838,2010-01-10,-5.466049,6061409.92
108,1,02-03-2012,1688420.76,0,60.96,3.630,220.848045,7.348,2012-02-03,-8.839506,7749830.68

In [92]:
# Obtener el maximo acumulativo de weekly_sales y agregar la columna 
# cum_max_sales 
sales_1_1['cum_max_sales'] = sales_1_1['Weekly_Sales'].cummax()
sales_1_1.head()

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment,Date2,Temperature_Celsious,cum_weekly_sales,cum_max_sales
60,1,01-04-2011,1495064.75,0,59.17,3.524,214.837166,7.682,2011-01-04,-9.391975,1495064.75,1495064.75
121,1,01-06-2012,1624477.58,0,77.95,3.501,221.747214,7.143,2012-01-06,-3.595679,3119542.33,1624477.58
73,1,01-07-2011,1488538.09,0,85.55,3.524,215.184137,7.962,2011-01-07,-1.250000,4608080.42,1624477.58
34,1,01-10-2010,1453329.50,0,71.89,2.603,211.671989,7.838,2010-01-10,-5.466049,6061409.92,1624477.58
108,1,02-03-2012,1688420.76,0,60.96,3.630,220.848045,7.348,2012-02-03,-8.839506,7749830.68,1688420.76

In [93]:
# Mostrar las columnas calculadas 
sales_1_1[['Date','Weekly_Sales', 'cum_weekly_sales', 'cum_max_sales']].head()

           Date  Weekly_Sales  cum_weekly_sales  cum_max_sales
60   01-04-2011    1495064.75        1495064.75     1495064.75
121  01-06-2012    1624477.58        3119542.33     1624477.58
73   01-07-2011    1488538.09        4608080.42     1624477.58
34   01-10-2010    1453329.50        6061409.92     1624477.58
108  02-03-2012    1688420.76        7749830.68     1688420.76

## Recuento 
----
Eliminar duplicados es una habilidad esencial para obtener recuentos precisos, porque a menudo no quieres contar lo mismo varias veces. En este ejercicio, crearás algunos DataFrames nuevos utilizando valores únicos de sales.

**Instrucciones**

- Elimina las filas de sales con pares duplicados de store y type y guárdalas como store_types e imprime la cabecera.
- Elimina las filas de sales con pares duplicados de store y department y guárdalas como store_depts e imprime la cabecera.
- Subconjunta

In [94]:
import pandas as pd 

sales_sub = pd.read_csv('./dataSets/sales_subset.csv', index_col=0)

In [95]:
sales_sub.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [96]:
sales_sub.shape

(10774, 9)

In [97]:
# Eliminar o hacer un drop a la combinacion de dupliccados de store/type
store_types = sales_sub.drop_duplicates(subset=['store', 'type'])
store_types.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
901,2,A,1,2010-02-05,35034.06,False,4.550000,0.679451,8.324
1798,4,A,1,2010-02-05,38724.42,False,6.533333,0.686319,8.623
2699,6,A,1,2010-02-05,25619.00,False,4.683333,0.679451,7.259
3593,10,B,1,2010-02-05,40212.84,False,12.411111,0.782478,9.765

In [98]:

# Eliminar los duplicados de store y department
store_depts = sales_sub.drop_duplicates(subset=['store', 'department'])
store_depts.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
12,1,A,2,2010-02-05,50605.27,False,5.727778,0.679451,8.106
24,1,A,3,2010-02-05,13740.12,False,5.727778,0.679451,8.106
36,1,A,4,2010-02-05,39954.04,False,5.727778,0.679451,8.106
48,1,A,5,2010-02-05,32229.38,False,5.727778,0.679451,8.106

In [99]:
# Segmentar todas las filas donde el campo is_holoday es True y eliminar los duplicados del campo Date y guardarlos en holiday_dates
holiday_dates = sales_sub[sales_sub['is_holiday']==True].drop_duplicates(subset=['date'])
holiday_dates.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
498,1,A,45,2010-09-10,11.47,True,25.938889,0.677602,7.787
691,1,A,77,2011-11-25,1431.00,True,15.633333,0.854861,7.866
2315,4,A,47,2010-02-12,498.00,True,-1.755556,0.679715,8.623
6735,19,A,39,2012-09-07,13.41,True,22.333333,1.076766,8.193
6810,19,A,47,2010-12-31,-449.00,True,-1.861111,0.881278,8.067

### Contar variables categóricas

Contar es una forma estupenda de tener una visión general de tus datos y de detectar curiosidades que de otro modo no notarías. En este ejercicio, contarás el número de cada tipo de tienda y el número de cada número de departamento utilizando los DataFrames que creaste en el ejercicio anterior:
```
# Drop duplicate store/type combinations
store_types = sales.drop_duplicates(subset=["store", "type"])

# Drop duplicate store/department combinations
store_depts = sales.drop_duplicates(subset=["store", "department"])

```
Los DataFrames store_types y store_depts que creaste en el último ejercicio están disponibles, y pandas se importa como pd.

**Instrucciones**

- Cuenta el número de tiendas de cada tienda type en store_types.
- Cuenta la proporción de tiendas de cada tienda type en store_types.
- Cuenta el número de tiendas de cada department en store_depts, ordenando los recuentos en orden descendente.
- Cuenta la proporción de tiendas de cada department en store_depts, ordenando las proporciones en orden descendente.

In [100]:
store_types.head()

,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
901,2,A,1,2010-02-05,35034.06,False,4.550000,0.679451,8.324
1798,4,A,1,2010-02-05,38724.42,False,6.533333,0.686319,8.623
2699,6,A,1,2010-02-05,25619.00,False,4.683333,0.679451,7.259
3593,10,B,1,2010-02-05,40212.84,False,12.411111,0.782478,9.765

In [101]:
# Contar el numero de tienedas de cada tipo 
store_counts = store_types['type'].value_counts()
store_counts

type
A    11
B     1
Name: count, dtype: int64

In [102]:
# obtener la proporcion de tiendas de cada tipo 
strore_props = store_types['type'].value_counts(normalize=True)*100
strore_props

type
A    91.666667
B     8.333333
Name: proportion, dtype: float64

In [103]:
# contar el numero de tiendas por cada departamento y ordenado 
dept_counts_stored = store_depts['department'].value_counts(sort=True)
dept_counts_stored

department
1     12
2     12
3     12
4     12
5     12
      ..
37    10
48     8
50     6
39     4
43     2
Name: count, Length: 80, dtype: int64

In [104]:
# Obtener la proporcioon de las tiendas en cada departamento y ordenadas
dept_props_stored = store_depts['department'].value_counts(normalize=True).sort_index() * 100
dept_props_stored

department
1     1.291712
2     1.291712
3     1.291712
4     1.291712
5     1.291712
        ...
95    1.291712
96    1.291712
97    1.291712
98    1.291712
99    1.184069
Name: proportion, Length: 80, dtype: float64

## Estadisticas resumisdas y agrupadas

Aunque .groupby() es útil, puedes calcular estadísticas de resumen agrupadas sin él.

Walmart distingue tres tipos de tiendas: "supercentros", "tiendas de descuento" y "mercados de barrio", codificados en este conjunto de datos como tipo "A", "B" y "C". En este ejercicio, calcularás las ventas totales realizadas en cada tipo de tienda, sin utilizar .groupby(). A continuación, puedes utilizar estas cifras para ver qué proporción de

In [105]:
# Calcular el total de ventas por semana 
sales_all = sales_sub['weekly_sales'].sum()
sales_all

np.float64(256894718.89999998)

In [106]:
# Segmentar para los tipos A y calcular el total de ventas por semana
sales_A = sales_sub[sales_sub['type'] == 'A']['weekly_sales'].sum()
sales_A

np.float64(233716315.01)

In [107]:
# Segmentar para los tipos B y calcular el total de ventas por semana
sales_B = sales_sub[sales_sub['type'] == 'B']['weekly_sales'].sum()
sales_B

np.float64(23178403.89)

In [108]:
# Segmentar para los tipos C y calcular el total de ventas por semana
sales_C = sales_sub[sales_sub['type'] == 'C']['weekly_sales'].sum()
sales_C

np.float64(0.0)

In [109]:
# obtener la proporcion de cada tipo 
sales_props_by_type = [sales_A, sales_B, sales_C] / sales_all * 100
sales_props_by_type

array([90.97746969,  9.02253031,  0.        ])

### Cálculos con .groupby()

El método .groupby() te facilita mucho la vida. En este ejercicio, realizarás los mismos cálculos que la última vez, excepto que utilizarás el método .groupby(). También realizarás cálculos sobre datos agrupados por dos variables para ver si las ventas difieren por tipo de tienda dependiendo de si es una semana festiva o no.

sales está disponible y pandas se carga como pd.

**Instrucciones**

- Agrupa sales por "type", toma la suma de "weekly_sales", y almacénala como sales_by_type.
- Calcula la proporción de ventas en cada tipo de tienda dividiendo por la suma de sales_by_type. Asignar a sales_propn_by_type.
- Agrupa sales por "type" y "is_holiday", toma la suma de weekly_sales, y almacénala como sales_by_type_is_holiday.

In [ ]:
sales_new = pd.read_csv('./dataSets/sales_subset.csv')
#Agrupar por tipo; calcular el total de ventas semanales
sales_by_type = sales_sub.groupby('type')['weekly_sales'].sum()
sales_by_type

type
A    2.337163e+08
B    2.317840e+07
Name: weekly_sales, dtype: float64

In [111]:
# Obtener la proporcion de cada tipo
sales_props_by_type = sales_by_type / sales_all * 100
sales_props_by_type

type
A    90.97747
B     9.02253
Name: weekly_sales, dtype: float64

In [112]:
# Agrupar por type y por is_holiday; calcular el total de ventas semanales
sales_by_type_holiday = sales_sub.groupby(['type', 'is_holiday'])['weekly_sales'].sum()
sales_by_type_holiday

type  is_holiday
A     False         2.336927e+08
      True          2.360181e+04
B     False         2.317678e+07
      True          1.621410e+03
Name: weekly_sales, dtype: float64

### Múltiples resúmenes agrupados

Anteriormente en este capítulo, has visto que el método .agg() es útil para calcular múltiples estadísticos sobre múltiples variables. También funciona con datos agrupados. NumPy, que se importa como np, tiene muchas funciones estadísticas de resumen diferentes, entre las que se incluyen: np.min, np.max, np.mean, y np.median.

sales está disponible y pandas se importa como pd.

**Instrucciones**

- Importa numpy con el alias np.
- Obtén el mínimo, el máximo, la media y la mediana de weekly_sales para cada tipo de tienda utilizando .groupby() y .agg(). Guárdalo como . ¡Asegúrate de utilizar las funciones de numpy!
- Obtén el mínimo, el máximo, la media y la mediana de unemployment y fuel_price_usd_per_l para cada tipo de tienda. Guárdalo como unemp_fuel_stats.

In [113]:
# Para cada tipo de tienda, hacer agregación para weekly_sales: obteenr el minimo,maximo y la media
sales_stats = sales_sub.groupby('type')['weekly_sales'].agg(['min', 'max', 'mean'])
sales_stats

         min        max          mean
type
A    -1098.0  293966.05  23674.667242
B     -798.0  232558.51  25696.678370

In [115]:
#para cada tipo de tienda, Hacer agregacion para los campos unemployment, fuel_price_usd_per_1: obtener el minimo,maximo, mean  y la media
unem_fuel_stats = sales_sub.groupby('type')[['unemployment','fuel_price_usd_per_l']].agg(['min', 'max', 'mean','median'])
unem_fuel_stats

     unemployment                         fuel_price_usd_per_l            \
              min    max      mean median                  min       max
type
A           3.879  8.992  7.972611  8.067             0.664129  1.107410
B           7.170  9.765  9.279323  9.199             0.760023  1.107674


          mean    median
type
A     0.744619  0.735455
B     0.805858  0.803348

## Pivot tables (Tablas Dinamicas)

### Pivotar sobre una variable

Las tablas dinámicas son la forma estándar de agregar datos en las hojas de cálculo.

En pandas, las tablas dinámicas son esencialmente otra forma de realizar cálculos agrupados. Es decir, el método .pivot_table() es una alternativa a .groupby().

En este ejercicio, realizarás cálculos utilizando .pivot_table() para reproducir los cálculos que realizaste en la lección anterior utilizando .groupby().

sales está disponible y pandas se importa como pd.

**Instrucciones**

- Obtén la media weekly_sales mediante type utilizando .pivot_table() y almacénala como mean_sales_by_type.
- Obtén la media y la mediana (utilizando funciones NumPy) de weekly_sales por type utilizando .pivot_table() y almacénalas como mean_med_sales_by_type.
- Obtén la media de weekly_sales mediante type y is_holiday mediante .pivot_table() y guárdala como mean_sales_by_type_holiday.